case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          783;
        startFace       176655;
    }
    outlet
    {
        type            patch;
        nFaces          494;
        startFace       177438;
    }
    constraint
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          6740;
        startFace       177932;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4388;
        startFace       184672;
    }
    defaultFaces
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2302;
        startFace       189060;
    }
)

// ************************************************************************* //
